subscriptions-v1/src/test/resources/examples/planCollection.json

{
  "plans": [
    {
      "id": "string",
      "product_id": "string",
      "name": "string",
      "status": "CREATED",
      "description": "string",
      "billing_cycles": [
        {
          "pricing_scheme": {
            "version": 999,
            "fixed_price": {
              "currency_code": "EUR",
              "value": "-.41508163878494650390"
            },
            "pricing_model": "VOLUME",
            "tiers": [
              {
                "starting_quantity": "56298528284411472369",
                "ending_quantity": "14314469404695579086329126382128",
                "amount": {
                  "currency_code": "EUR",
                  "value": "-0119051523626270109434147195091"
                }
              }
            ],
            "create_time": "2020-05-27T12:13:51Z",
            "update_time": "2020-05-27T12:13:51Z"
          },
          "frequency": {
            "interval_unit": "DAY",
            "interval_count": 1
          },
          "tenure_type": "REGULAR",
          "sequence": 99,
          "total_cycles": 1
        }
      ],
      "payment_preferences": {
        "auto_bill_outstanding": true,
        "setup_fee": {
          "currency_code": "EUR",
          "value": "2385515366857"
        },
        "setup_fee_failure_action": "CANCEL",
        "payment_failure_threshold": 0
      },
      "taxes": {
        "percentage": "1811141137254581",
        "inclusive": true
      },
      "quantity_supported": false,
      "create_time": "2020-05-27T12:13:51Z",
      "update_time": "2020-05-27T12:13:51Z",
      "links": [
        {
          "href": "string",
          "rel": "string",
          "method": "GET"
        }
      ]
    }
  ],
  "total_items": 500000000,
  "total_pages": 100000000,
  "links": [
    {
      "href": "string",
      "rel": "string",
      "method": "GET"
    }
  ]
}